backend/controllers/ItemController.php

SELECT * FROM `item` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = Item::findOne($id)) !== null) {